In [2]:
import pandas as pd

friends = [
    {'age':15, 'job': 'student'},
    {'age':25, 'job': 'developer'},
    {'age':30, 'job': 'teacher'}
]

df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate' ],
                  columns = ['age', 'job'])

In [3]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [4]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [5]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [6]:
df = df.drop(['John', 'Nate'])

In [7]:
df

       age        job
Jenny   25  developer

In [19]:
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate' ],
                  columns = ['age', 'job'])

In [20]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [21]:
df.drop(['John', 'Nate'], inplace  = True)

In [22]:
df

       age        job
Jenny   25  developer